{
  "backend/main.mo": "Motoko backend actor managing user profiles and service requests with access control, status tracking, notes, and CRUD-style operations.",
  "feature_evidence.json": "Feature evidence report listing branding‑related features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend page, component, and hook in the app.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, light/dark mode tokens, and global style resets.",
  "frontend/index.html": "HTML entry point configuring root element and document title for the frontend.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, global layout, theming, and application providers.",
  "frontend/src/components/admin/NotesPanel.tsx": "Admin panel for viewing and adding public or internal notes on a request.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with login and home navigation options.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Guards admin routes by verifying authentication and admin status before rendering children.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout button logic using Internet Identity with loading states.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to submit basic profile information.",
  "frontend/src/components/BrandCard.tsx": "Reusable card wrapper with consistent border, background, and shadow styling.",
  "frontend/src/components/FormField.tsx": "Wrapper component adding labels, helper text, and error display around form inputs.",
  "frontend/src/components/PricingSection.tsx": "Displays categorized service pricing using BrandCard components and data from the services catalog.",
  "frontend/src/components/RequestStatusTimeline.tsx": "Renders a vertical timeline of request status changes with icons, timestamps, and current-status highlighting.",
  "frontend/src/components/ServiceSelectionList.tsx": "Displays service groups with checkboxes and handles selection state updates.",
  "frontend/src/components/SiteFooter.tsx": "Renders site footer with service links, support links, and branding information.",
  "frontend/src/components/SiteHeader.tsx": "Renders the main header with navigation, login button, mobile menu, and pricing scroll behavior.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance based on identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useClientSideReferenceImages.ts": "Manages client-side reference image files with add, remove, and clear utilities.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, including login, logout, and stored identity loading.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating, fetching, and updating service requests through the backend actor.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/src/lib/branding.ts": "Exports app branding constants including name, subtitle, and full title.",
  "frontend/src/lib/servicesCatalog.ts": "Defines a catalog of services with pricing and helper functions for filtering, formatting prices, and calculating totals.",
  "frontend/src/lib/statusUtils.ts": "Maps request statuses to human-readable labels and UI variants.",
  "frontend/src/lib/utils.ts": "Exports a utility function to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminRequestDetailPage.tsx": "Admin view for a single request with status updates, price editing, and notes panel.",
  "frontend/src/pages/admin/AdminRequestsPage.tsx": "Admin list page showing all service requests with filtering by status and navigation to detail views.",
  "frontend/src/pages/LandingPage.tsx": "Landing page component with hero, services preview, navigation buttons, and hash-based scroll handling.",
  "frontend/src/pages/ServiceRequestConfirmationPage.tsx": "Displays confirmation details for a submitted service request, including request ID and navigation options.",
  "frontend/src/pages/ServiceRequestPage.tsx": "Form page for creating service requests with validation, image uploads, service selection, and submission via API.",
  "frontend/src/pages/StatusLookupPage.tsx": "Lookup page allowing users to enter a request ID and view request details and status timeline.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, and plugins.",
  "project_state.json": "Tracks project metadata, existing features, and state including schema version and project name. Contains branding update feature entries and no new feature requests."
}