{
  "backend/main.mo": "Motoko canister managing user profiles and service requests with access control, status tracking, notes, and CRUD operations.",
  "feature_evidence.json": "Feature evidence report describing a UI change to the controller platform select and listing affected files and metadata.",
  "frontend-file-summaries.txt": "Collection of short summaries for all frontend files including pages, components, hooks, and utilities.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme provider, layout, and admin guards.",
  "frontend/src/components/admin/NotesPanel.tsx": "Manages viewing and adding public or internal notes on a request, including form inputs and notes list rendering.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Shows an access denied message with login or home navigation options depending on authentication state.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin routes by checking identity and admin status and showing loading or access denied screens as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Handles login/logout using Internet Identity and displays button states with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts authenticated users without a profile to enter name and optional email, saving the profile on submit.",
  "frontend/src/components/BrandCard.tsx": "Reusable styled card wrapper component using Tailwind classes.",
  "frontend/src/components/FormField.tsx": "Form field wrapper providing label, error, helper text, and layout consistency.",
  "frontend/src/components/PricingSection.tsx": "Pricing section displaying categorized service lists with prices using BrandCard and catalog utilities.",
  "frontend/src/components/RequestStatusTimeline.tsx": "Timeline component rendering sorted status history with icons, timestamps, and current status highlighting.",
  "frontend/src/components/ServiceSelectionList.tsx": "Renders grouped service checkboxes and handles selection updates for repairs, customization, and performance services.",
  "frontend/src/components/SiteFooter.tsx": "Displays footer sections with service lists, links, and attribution including dynamic year and hostname-based tracking link.",
  "frontend/src/components/SiteHeader.tsx": "Provides site navigation with desktop and mobile menus, login button, pricing scroll behavior, and admin link handling.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useClientSideReferenceImages.ts": "Manages client-side image files with preview URLs, supporting add, remove, and clear operations.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication using AuthClient, exposing identity state and login/logout helpers.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for creating, fetching, and updating service requests via the backend actor API.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables and base styles for light and dark modes.",
  "frontend/src/lib/servicesCatalog.ts": "Contains a static service catalog with pricing plus helpers to filter services, format prices, and calculate totals.",
  "frontend/src/lib/statusUtils.ts": "Maps backend RequestStatus values to human-readable labels and UI variants.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge CSS class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminRequestDetailPage.tsx": "Admin page showing full request details with status and price editing, notes, and timeline.",
  "frontend/src/pages/admin/AdminRequestsPage.tsx": "Admin list view for all service requests with status filtering and navigation to detail pages.",
  "frontend/src/pages/LandingPage.tsx": "Landing page with hero content, service previews, and scroll handling for pricing navigation.",
  "frontend/src/pages/ServiceRequestConfirmationPage.tsx": "Displays a confirmation message and request ID after submitting a service request.",
  "frontend/src/pages/ServiceRequestPage.tsx": "Provides a form to create a service request with validation, image handling, and submission via backend.",
  "frontend/src/pages/StatusLookupPage.tsx": "Customer page to search a service request by ID and display its details and status timeline.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, layout, animations, and plugins.",
  "project_state.json": "Metadata describing project state, features, and pending requests for the controller platform selector update."
}