{
  "backend/main.mo": "Motoko backend defining user profiles and service request types with access‑controlled CRUD operations and status/notes management.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base and theme variable definitions configuring light/dark mode colors and global styles.",
  "frontend/index.html": "HTML entry file setting favicon and Open Graph assets and loading the React app root.",
  "frontend/src/App.tsx": "Main React app wiring routes, layout, theme provider, and admin guards using TanStack Router.",
  "frontend/src/components/admin/NotesPanel.tsx": "Manages viewing and adding public and internal notes for a request, including form inputs and note lists.",
  "frontend/src/components/auth/AccessDeniedScreen.tsx": "Displays an access denied message with login and home navigation options depending on user authentication state.",
  "frontend/src/components/auth/AdminRouteGuard.tsx": "Protects admin-only routes by checking authentication and admin status, showing loaders or denial screens as needed.",
  "frontend/src/components/auth/LoginButton.tsx": "Provides login/logout functionality with loading states based on Internet Identity authentication.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Prompts newly authenticated users to create a profile, collecting name and optional email before continuing.",
  "frontend/src/components/BrandCard.tsx": "Styled card component providing consistent border, background, and shadow for section content.",
  "frontend/src/components/FormField.tsx": "Reusable form field wrapper handling labels, helper text, required markers, and error messages.",
  "frontend/src/components/PricingSection.tsx": "Pricing section rendering categorized service lists with prices using BrandCard and service catalog utilities.",
  "frontend/src/components/RequestStatusTimeline.tsx": "Displays a chronological timeline of request status changes with timestamps and highlights the current status.",
  "frontend/src/components/ServiceSelectionList.tsx": "Renders grouped selectable services with checkboxes and pricing, allowing users to toggle selected services.",
  "frontend/src/components/SiteFooter.tsx": "Shows a multi-column site footer with links, service info, and branding details including a dynamic year and referral link.",
  "frontend/src/components/SiteHeader.tsx": "Provides the main navigation header with login, admin links, a mobile menu, and smooth scrolling to the pricing section.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useClientSideReferenceImages.ts": "Manages a list of locally stored reference images with add, remove, and clear helpers using object URLs.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication state, login/logout helpers, and persisted identity loading via a React context provider.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend service‑request operations with React Query for creating, fetching, and updating service requests and notes.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and base styling.",
  "frontend/src/lib/branding.ts": "Exports app‑wide branding constants such as name, subtitle, and title.",
  "frontend/src/lib/servicesCatalog.ts": "Defines the service catalog with pricing and helpers for filtering, formatting prices, and calculating totals.",
  "frontend/src/lib/statusUtils.ts": "Maps request statuses to display labels and UI variants.",
  "frontend/src/lib/utils.ts": "Exports a utility function for merging class names using clsx and tailwind‑merge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminRequestDetailPage.tsx": "Admin page showing full request details with controls to update status and price estimates, plus notes and timeline.",
  "frontend/src/pages/admin/AdminRequestsPage.tsx": "Admin overview table listing all service requests with filtering by status and links to detail pages.",
  "frontend/src/pages/LandingPage.tsx": "Renders the public landing page with hero content, services preview, and navigation actions.",
  "frontend/src/pages/ServiceRequestConfirmationPage.tsx": "Shows a confirmation screen after submitting a service request, displaying the request ID and navigation options.",
  "frontend/src/pages/ServiceRequestPage.tsx": "Form page for users to submit service requests, manage selected services, validate inputs, upload images, and send data to the backend.",
  "frontend/src/pages/StatusLookupPage.tsx": "Provides a search form to look up a service request by ID and displays its details and status timeline.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, containers, animations, and plugin setup.",
  "project_state.json": "Holds the project’s current state, including schema version, feature lists, image asset requirements, and an in-progress request to replace and resize the app logo. Describes existing features for generating and applying updated logo assets across the UI and HTML head."
}