{
  "kind": "build_request",
  "title": "Rename app to \"K's Lab repair and customization\" across branding and metadata",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the single source of truth branding constants so the app name is exactly \"K's Lab repair and customization\" and the computed title uses that updated name.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "can you change the app name to K's Lab repair and customization",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/src/lib/branding.ts` exports `APP_NAME` exactly as \"K's Lab repair and customization\".",
        "Any derived branding string (e.g., `APP_TITLE`) reflects the updated app name without additional/old naming."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Replace all user-facing occurrences of the old app name (currently \"K's Lab Customization\") with \"K's Lab repair and customization\" across the marketing landing page hero heading, header brand text, footer copyright line, and the HTML document <title>.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3",
          "msg-5"
        ],
        "quotes": [
          "can you change the app name to K's Lab repair and customization",
          "yes"
        ]
      },
      "acceptanceCriteria": [
        "Landing page hero heading displays \"K's Lab repair and customization\".",
        "Header brand text displays \"K's Lab repair and customization\" on desktop sizes.",
        "Footer copyright line displays \"K's Lab repair and customization\".",
        "`frontend/index.html` `<title>` reflects the updated name (and does not contain \"K's Lab Customization\").",
        "A project-wide search shows no remaining user-facing string \"K's Lab Customization\" (except where required in historical data/test fixtures, if any)."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not edit files under `frontend/src/components/ui` (compose existing UI components instead).",
    "Do not modify immutable frontend hook files listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useInternetIdentity.ts[x]`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`)."
  ],
  "nonGoals": [
    "No backend (Motoko) schema, state, or API changes.",
    "No changes to authentication/Internet Identity flow.",
    "No redesign of the UI beyond updating the name/branding text."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}